[{
        "date": "20200127",
        "changes": [{
            "forAgency": false,
            "text": "Добавлен функционал автоматического составления маршрута перевозки туристов на каждый день тура."
        }, {
            "forAgency": false,
            "text": "В режиме редактирования тура исправлена ошибка при переключении между вкладками конструктора. Ранее - объекты тура не отображались, если не нажать кнопку \"Далее\" на первой вкладке."
        }, {
            "forAgency": false,
            "text": "В конструкторе тура у \"бесплатных взрослых\" исправлена выпадавшая из карточки кнопка \"Сохранить\"."
        }]
    },
    {
        "date": "20200123",
        "changes": [{
            "forAgency": true,
            "text": "Реализован \"динамический брендинг\". Теперь авторизованное агентство видит название, адрес и контакты туроператора, на которого агентство подписано. Оператор увидит свои данные."
        }, {
            "forAgency": true,
            "text": "Исправлена форма регистрации, при неудачной попытке все введённые данные сохраняются."
        }, {
            "forAgency": true,
            "text": "Изменены требования к паролям. Стало: \"Пароль должен содержать не менее 6 символов\"."
        }]
    },
    {
        "date": "20200117",
        "changes": [{
            "forAgency": false,
            "text": "В разделах \"Заказы\" и \"Туры\" добавлены фильтры."
        }]
    },
    {
        "date": "20200115",
        "changes": [{
            "forAgency": false,
            "text": "Решены вопросы с \" закэшированными\" данными при добавлении/редактировании туров, из-за чего для продолжения корректной работы было необходимо перезагружать страницу со списком туров."
        }]
    },
    {
        "date": "20191223",
        "changes": [{
                "forAgency": false,
                "text": "Убрана возможность выбора нескольких дат/времён начала тура. Для каждой даты - копируйте созданный тур."
            },
            {
                "forAgency": false,
                "text": "Добавлен новый сценарий конструктора тура: \"Тур от партнёра\". Новый сценарий состоит всего из двух этапов: 1. заполнение общих опций тура (настройки, города, количество дней/ночей/туристов); 2. Добавление расценок и допов, указание партнёра и комиссии, заполнение программы тура."
            }
        ]
    },
    {
        "date": "20191218",
        "changes": [{
            "forAgency": false,
            "text": "Добавлен документ для туроператоров: \"Уведомление в ГИБДД об организованной перевозке детей\"."
        }]
    },
    {
        "date": "20191216",
        "changes": [{
            "forAgency": true,
            "text": "Добавлены недостающие реквизиты юр.лиц: БИК, ОКПО, ОГРН, имя генерального директора. Так же добавлены их метки в шаблоны документов."
        }]
    },
    {
        "date": "20191212",
        "changes": [{
            "forAgency": true,
            "text": "Новые метки в шаблонах: данные по заказам и туристам."
        }]
    },
    {
        "date": "20191211",
        "changes": [{
                "forAgency": true,
                "text": "Добавлено ещё больше меток для шаблонов документов: все юридические реквизиты агентства и оператора."
            },
            {
                "forAgency": true,
                "text": "В шаблонах можно выбрать кому будет доступен документ: агенстство или турист. И в каком формате: pdf или word."
            }
        ]
    },
    {
        "date": "20191205",
        "changes": [{
            "forAgency": true,
            "text": "Добавлен модуль для работы с шаблонами документов. Можно добавить текст документа с помощью визуального редактора (WYSIWYG), расставить метки, например {ФИО туриста} и получить возможность скачать одинаковый документ в формате pdf для разных туристов с их актуальными данными."
        }]
    },
    {
        "date": "20191129",
        "changes": [{
            "forAgency": true,
            "text": "Список туров, доступных для заказа Агентству, теперь можно фильтровать по названию."
        }]
    },
    {
        "date": "20191128",
        "changes": [{
            "forAgency": false,
            "text": "В конструкторе тура теперь можно выбрать даты и время начала тура. Создаётся один тур и набор дат к нему, изменив тур, изменения применятся ко всем выбранным датам/временам."
        }]
    },
    {
        "date": "20191125",
        "changes": [{
                "forAgency": false,
                "text": "Всем объектам добавлено поле \"адрес\"."
            },
            {
                "forAgency": false,
                "text": "Поле \"город\" у всех объектов стало авто-дополняемым. Просто начните вводить название города и список отфильтруется автоматически."
            },
            {
                "forAgency": false,
                "text": "В конструкторе тура, отель теперь считаются по \"ночам\", а не \"дням\"."
            }
        ]
    },
    {
        "date": "20191122",
        "changes": [{
                "forAgency": false,
                "text": "Возможность выбрать тип размещения появилась и у \"бесплатных взрослых\""
            },
            {
                "forAgency": false,
                "text": "В Конструкторе туров теперь можно сохранить тур на любой стадии заполнения и позже вернуться к его редактированию/дополнению."
            },
            {
                "forAgency": false,
                "text": "Добавлена функция округления цен на этапе расчёта тура. Округлять можно до 100 и до 1000 в большую сторону, а так же после округления вычитать 10 или 100 из полученной цифры, для получения более красивой цены, например, 14900 руб., 3890 руб.."
            }
        ]
    },
    {
        "date": "20191121",
        "changes": [{
            "forAgency": false,
            "text": "В конструкторе появилась возможность выбирать тип размещения (сингл или стандарт) для персонала: гидов, водителей, сопровождающих."
        }]
    },
    {
        "date": "20191120",
        "changes": [{
            "forAgency": false,
            "text": "Добавлена функция редактирования данных водителя транспорта."
        }]
    },
    {
        "date": "20191119",
        "changes": [{
                "forAgency": false,
                "text": "В справочнике \"Транспорт\" объектам добавлены поля для данных по водителям и документам на транспортное средство."
            },
            {
                "forAgency": false,
                "text": "Добавлен документ \"Уведомление в ГИБДД\" в справочнике \"Туры\"."
            },
            {
                "forAgency": true,
                "text": "Исправлен перерасчёт комиссии за весь заказ при добавлении/отмене доп. экскурсий."
            }
        ]
    },
    {
        "date": "20191114",
        "changes": [{
                "forAgency": true,
                "text": "Исправлен автоподбор цены для иностранцев при выборе доп. экскурсий."
            },
            {
                "forAgency": false,
                "text": "Ранее в форме редактирования музея поле \"город\" не заполнялось. Исправлено."
            }
        ]
    },
    {
        "date": "20191113",
        "changes": [{
                "forAgency": true,
                "text": "Выбор дополнительных экскурсий стал доступен Агентствам."
            },
            {
                "forAgency": false,
                "text": "Город в конструкторе тура теперь можно отфильтровать, введя часть названия."
            }
        ]
    },
    {
        "date": "20191112",
        "changes": [{
                "forAgency": false,
                "text": "Добавлено поле \"Может быть допом\" при добавлении экскурсий. "
            },
            {
                "forAgency": true,
                "text": "Кнопки из панели навигации получили фон."
            },
            {
                "forAgency": false,
                "text": "В расчёте тура можно выбирать опциональные экскурсии. "
            }
        ]
    },
    {
        "date": "20191111",
        "changes": [{
                "forAgency": true,
                "text": "В форме входа теперь автоматически фокусируется поле логина."
            },
            {
                "forAgency": true,
                "text": "Данные из формы входа могут отправляться по нажатию Enter."
            }
        ]
    },
    {
        "date": "20191108",
        "changes": [{
                "forAgency": false,
                "text": "Исправлен пересчёт цены тура при изменении количества туристов."
            },
            {
                "forAgency": true,
                "text": "Актуализирована форма регистрации для физ.лиц. (Убраны лишние поля)."
            }
        ]
    },
    {
        "date": "20191104",
        "changes": [{
                "forAgency": true,
                "text": "Исправлена кодировка в сообщениях об ошибках."
            },
            {
                "forAgency": true,
                "text": "Передизайнены формы входа и сброса пароля."
            }
        ]
    },
    {
        "date": "20191030",
        "changes": [{
            "forAgency": true,
            "text": "Исправлено отображение списка обновлений."
        }]
    },
    {
        "date": "20191028",
        "changes": [{
                "forAgency": true,
                "text": "Добавлены недостающие поля в реквизитах компании."
            },
            {
                "forAgency": true,
                "text": "Имя пользователя в меню навбара убрано внутрь выпадающего меню."
            },
            {
                "forAgency": true,
                "text": "Уменьшен логотип TourClick."
            },
            {
                "forAgency": false,
                "text": "Убран ввод суммы по заказу на стороне Агентства."
            },
            {
                "forAgency": false,
                "text": "Добавлено брендирование \"Алфавит\"."
            },
            {
                "forAgency": false,
                "text": "Скрыт выбор питания при оформлении заказа."

            },
            {
                "forAgency": true,
                "text": "Убраны лишние ссылки из \"Управления\" у Агентства."
            },
            {
                "forAgency": true,
                "text": "Добавлен этот компонент."
            }
        ]
    }
]
